### OpenTofu Plan

<details>
<summary>Plan output</summary>

```
data.cloudflare_zone.zone: Reading...
cloudflare_pages_project.preview: Refreshing state... [id=slop-preview]
cloudflare_pages_project.project["homepage"]: Refreshing state... [id=slop-homepage]
cloudflare_pages_project.project["roof-calculator"]: Refreshing state... [id=slop-roof-calculator]
cloudflare_pages_project.project["dnd-encounter-generator"]: Refreshing state... [id=slop-dnd-encounter-generator]
data.cloudflare_zone.zone: Read complete after 1s [id=b0bbb73ab7658015ba0417687e96c6ad]
cloudflare_record.cname["dnd-encounter-generator"]: Refreshing state... [id=9463936cfb4995d16cbf8bdbe1843c78]
cloudflare_record.cname["roof-calculator"]: Refreshing state... [id=9394157b59c935b2a57fda73b3b67ac0]
cloudflare_pages_domain.domain["dnd-encounter-generator"]: Refreshing state... [id=3a2a6583-9f80-4c6e-b1ac-83bf56c52f81]
cloudflare_record.cname["homepage"]: Refreshing state... [id=f874cfae4512fd0060402034cb8c46a9]
cloudflare_pages_domain.domain["roof-calculator"]: Refreshing state... [id=afa26454-f2e7-44c5-8564-544affb89a87]
cloudflare_pages_domain.domain["homepage"]: Refreshing state... [id=607321eb-07f5-469e-a6e1-ff658dfe5230]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # cloudflare_pages_domain.domain["cron"] will be created
  + resource "cloudflare_pages_domain" "domain" {
      + account_id   = "2753badc3d49006d87db13ca87c436d1"
      + domain       = "cron.slop.zackpollard.pro"
      + id           = (known after apply)
      + project_name = "slop-cron"
      + status       = (known after apply)
    }

  # cloudflare_pages_domain.domain["json"] will be created
  + resource "cloudflare_pages_domain" "domain" {
      + account_id   = "2753badc3d49006d87db13ca87c436d1"
      + domain       = "json.slop.zackpollard.pro"
      + id           = (known after apply)
      + project_name = "slop-json"
      + status       = (known after apply)
    }

  # cloudflare_pages_domain.domain["subnet"] will be created
  + resource "cloudflare_pages_domain" "domain" {
      + account_id   = "2753badc3d49006d87db13ca87c436d1"
      + domain       = "subnet.slop.zackpollard.pro"
      + id           = (known after apply)
      + project_name = "slop-subnet"
      + status       = (known after apply)
    }

  # cloudflare_pages_project.project["cron"] will be created
  + resource "cloudflare_pages_project" "project" {
      + account_id        = "2753badc3d49006d87db13ca87c436d1"
      + created_on        = (known after apply)
      + domains           = (known after apply)
      + id                = (known after apply)
      + name              = "slop-cron"
      + production_branch = "main"
      + subdomain         = (known after apply)
    }

  # cloudflare_pages_project.project["json"] will be created
  + resource "cloudflare_pages_project" "project" {
      + account_id        = "2753badc3d49006d87db13ca87c436d1"
      + created_on        = (known after apply)
      + domains           = (known after apply)
      + id                = (known after apply)
      + name              = "slop-json"
      + production_branch = "main"
      + subdomain         = (known after apply)
    }

  # cloudflare_pages_project.project["subnet"] will be created
  + resource "cloudflare_pages_project" "project" {
      + account_id        = "2753badc3d49006d87db13ca87c436d1"
      + created_on        = (known after apply)
      + domains           = (known after apply)
      + id                = (known after apply)
      + name              = "slop-subnet"
      + production_branch = "main"
      + subdomain         = (known after apply)
    }

  # cloudflare_record.cname["cron"] will be created
  + resource "cloudflare_record" "cname" {
      + allow_overwrite = true
      + content         = (known after apply)
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "cron.slop"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "b0bbb73ab7658015ba0417687e96c6ad"
    }

  # cloudflare_record.cname["json"] will be created
  + resource "cloudflare_record" "cname" {
      + allow_overwrite = true
      + content         = (known after apply)
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "json.slop"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "b0bbb73ab7658015ba0417687e96c6ad"
    }

  # cloudflare_record.cname["subnet"] will be created
  + resource "cloudflare_record" "cname" {
      + allow_overwrite = true
      + content         = (known after apply)
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "subnet.slop"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "b0bbb73ab7658015ba0417687e96c6ad"
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ custom_domains = {
      + cron                    = {
          + domain = "cron.slop.zackpollard.pro"
          + status = (known after apply)
        }
      + json                    = {
          + domain = "json.slop.zackpollard.pro"
          + status = (known after apply)
        }
      + subnet                  = {
          + domain = "subnet.slop.zackpollard.pro"
          + status = (known after apply)
        }
        # (3 unchanged attributes hidden)
    }
  ~ pages_projects = {
      + cron                    = {
          + name      = "slop-cron"
          + subdomain = (known after apply)
        }
      + json                    = {
          + name      = "slop-json"
          + subdomain = (known after apply)
        }
      + subnet                  = {
          + name      = "slop-subnet"
          + subdomain = (known after apply)
        }
        # (3 unchanged attributes hidden)
    }

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    tofu apply "tfplan"
```

</details>